app/views/admin/cds/edit.html.erb

SELECT "artists".* FROM "artists"
---
		<label>アーティスト名</label><br>
				<%= f.collection_select(:artist_id, Artist.all, :id, :name) %>

SELECT "labels".* FROM "labels"
---
		<label>レーベル</label><br>
		    <%= f.collection_select(:label_id, Label.all, :id, :name) %>

SELECT "genres".* FROM "genres"
---
		<label>CDジャンル</label><br>
		    <%= f.collection_select(:genre_id, Genre.all, :id, :name) %>