app/views/admin/cds/new.html.erb

		    <div class="edit-pull">
				<%= f.collection_select(:artist_id, Artist.all, :id, :name) %>
---
SELECT "artists".* FROM "artists"

		    <div class="edit-pull">
		        <%= f.collection_select(:label_id, Label.all, :id, :name) %>
---
SELECT "labels".* FROM "labels"

		    <div class="edit-pull">
		        <%= f.collection_select(:genre_id, Genre.all, :id, :name) %>
---
SELECT "genres".* FROM "genres"