app/controllers/admin/artists_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "AAA"], ["created_at", "2019-04-17 01:14:26.869042"], ["updated_at", "2019-04-17 01:14:26.869042"]]
---
  def create
    @artist = Artist.new(artist_params)
    @artist.save