app/controllers/admin/cds_controller.rb

SELECT "artists".* FROM "artists"
SELECT "labels".* FROM "labels"
SELECT "genres".* FROM "genres"
---
  def new
    if current_user.admin != true
      redirect_to public_cds_path
    end
    @cd = Cd.new
    @artist = Artist.new
    @artists = Artist.all
    @label = Label.new
    @labels = Label.all
    @genre = Genre.new
    @genres = Genre.all

SELECT "artists".* FROM "artists"
SELECT "labels".* FROM "labels"
SELECT "genres".* FROM "genres"
---
  def edit
    @cd = Cd.find(params[:id])
    @artist = Artist.new
    @artists = Artist.all
    @label = Label.new
    @labels = Label.all
    @genre = Genre.new
    @genres = Genre.all