app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ロック"], ["created_at", "2019-04-17 01:05:58.396198"], ["updated_at", "2019-04-17 01:05:58.396198"]]
---
  def create
  	@genre = Genre.new(genre_params)
    binding.pry
    if @genre.save