app/controllers/admin/labels_controller.rb

INSERT INTO "labels" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "I've"], ["created_at", "2019-04-17 01:15:31.517701"], ["updated_at", "2019-04-17 01:15:31.517701"]]
---
  def create
  	@label = Label.new(label_params)
    if @label.save