app/controllers/admin/musics_controller.rb

  def create
    musics = musics_params
    cd_id = 0
    musics.each do |music|
      m = Music.new(music_params(music))
      cd_id = m.cd_id
      m.save
---
INSERT INTO "musics" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-04-22 04:11:05.701611"], ["updated_at", "2019-04-22 04:11:05.701611"]]

  def update
    @music = Music.find(params[:id])
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def destroy
    if current_user.admin != true
      redirect_to public_cds_path
    end
    music = Music.find(params[:id])
    music.destroy
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 15]]