app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        	@user = current_user
        	@cd_users = if params[:search]
                User.search(params[:search])