app/controllers/public/cds_controller.rb

  def show
    @review = Review.new
    if signed_in?
      @user = current_user
    end
  	@cd = Cd.find(params[:id])
    @reviews = Review.where(cd_id: @cd.id)
    if @cd.deleated == true
        redirect_to public_cds_path
    else
        @musics1 = @cd.musics.order("disk_number")
        @musics = @musics1.order("track")
---
SELECT "musics".* FROM "musics" WHERE "musics"."cd_id" = ? ORDER BY disk_number  [["cd_id", 5]]
SELECT "musics".* FROM "musics" ORDER BY "musics"."track" ASC