app/controllers/public/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "first_name_kana" = ?, "last_name_kana" = ?, "post_number" = ?, "address" = ?, "phone_number" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
    def update
        	@user = User.find(params[:id])
            @user.update(user_params)