app/views/public/users/top.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
       <p><%= review.created_at.strftime('%Y/%m/%d %H:%M') %></p>
       <p><%= review.user.first_name %></p>